package cn.hd.enums;

import java.util.HashMap;
import java.util.Map;

/**
 * Created by 孙刚 on 2016/4/11.
 */
public enum ErrorCode {
    //公共错误：
    成功("AAAAAAA","成功")
    ,系统异常("1000001","系统异常")//这个用了，如果改请通知
    ,交易重复("1000002", "交易重复")//这个编号票据用了，如果改请通知
    ,流量超限("1000003", "流量超限")
    ,超长("1000004","%s超长")
    ,输入为空("100005","输入为空")
    ,必填字段为空("1000006","%s必填属性不能为空")
    ,不合法的字典("1000007","不合法的字典编码%s")
    ,组合交易处理失败("1110001","组合交易所有子交易处理失败")
    //批复检查与新增：
    ,额度节点没有维度("2000001","额度节点%s没有维度")
    ,维度无值("2000002","维度%s无值")
    ,根节点的是否可循环必须与批复的是否可循环一致("2000003","根节点的是否可循环必须与批复的是否可循环一致")
    ,不可循环的授信申请中明细额度必须是不可循环的("2000004","不可循环的授信申请中，明细额度必须是不可循环的，请重新确认！")
    ,节点必填字段为空("2000005","%s节点%s必填属性不能为空")
    ,维度必填字段为空("2000006","%s维度%s必填属性不能为空")
    ,xxx父节点xxx主切分维度切分不完整("2000007","%s父节点%s主切分维度切分不完整")
    ,管控系统不存在对应的客户("2000008","管控系统不存在对应的客户%s")
    ,请重新确认额度生效日("2000009","请重新确认额度生效日")
    ,请重新确认额度到期日("2000010","请重新确认额度到期日")
    ,额度系统中不存在合适的汇率数据("2000011","额度系统中不存在合适的汇率数据")
    ,已经存在开放型网络("2000012","已经存在开放型网络%s")
    ,未知业务模式("2000013","未知业务模式")
    ,已经存在供应链网络成员相关批复("2000014","已经存在供应链网络成员相关批复%s")
    ,已经存在总行级网络("2000015","已经存在总行级网络%s")
    ,已经存在网络("2000016","已经存在网络%s")
    ,单项下层金额不能大于上层金额("2000017","单项下层金额不能大于上层金额")
    ,上层节点不可循环下层节点必须不可循环("2000018","%s上层节点不可循环下层节点必须不可循环")
    ,低风险业务额度敞口金额必须为0("2000019","低风险业务%s额度敞口金额必须为0")
    ,非低风险业务额度敞口金额必须大于0("2000020","非低风险业务额度敞口金额必须大于0")
    ,额度子类型必须是他用额度("2000021","供应链金融买方额度/供应链金融卖方额度%s额度子类型必须是他用额度")
    ,供应链金融买方额度或供应链金融卖方额度网络级别和网络类型必须为非空("2000022","供应链金融买方额度或供应链金融卖方额度网络级别和网络类型必须为非空")
     ,批复已经存在("2000023","批复已经存在")
    ,额度批复只能有一个根节点("2000024","额度批复只能有一个根节点")
    ,节点找不到父节点("2000025","节点%s找不到父节点")
    ,额度树没有根节点("2000026","额度树没有根节点")
    ,额度树转换失败("2000027","额度树转换失败")
    ,维度币种必须涵盖节点币种("2000028","维度%s币种必须涵盖节点币种")
    ,首笔提款有效期限单位只能是月日年("2000029","首笔提款有效期限单位只能是月日年")
    ,额度期限单位只能是月日年("2000030","额度期限单位只能是月日年")
    ,低风险业务额度授信金额必须大于0("2000031","低风险业务%s额度授信金额必须大于0")
    ,主维度与约束维度的维度类型不能相同("2000032","节点‘%s’的主维度与约束维度的维度类型不能相同")
    ,下级节点不在上级节点维度值内("2000033","节点‘%s’的维度值不在上级节点维度值内")
    ,存在叶子节点不可达("2000034","存在叶子节点不可达")
    ,调用公共平台查询机构失败("2000035","调用公共平台查询机构失败")
    ,调用本地查询机构失败("2000036","调用本地查询机构失败")
    ,兄弟节点主维度值存在交集("2000037","兄弟节点主维度值存在交集")
    ,存在双向关联关系("2000038","存在双向关联关系")
    ,存在环路关联关系("2000039","存在环路关联关系")
    ,关联批复不存在("2000040","关联批复不存在")
    ,维度状态不唯一("2000041","维度状态不唯一")
//纳入相关
    ,纳入关系已经存在("2100001","纳入关系已经存在")
    ,非纳入关系已经存在("2100002","非纳入关系已经存在")

    ,存在循环纳入关系("2100003","存在循环纳入关系")
    ,请录入被纳入额度("2100004","请录入被纳入额度")
    ,被纳入批复额度必须小于纳入批复额度("2100005","被纳入批复额度必须小于等于纳入批复额度")
    ,不支持的关系类型("2100006","不支持的关系类型")
    ,某批复不存在("2100007","批复%s不存在")
    ,批复失效("2100008","批复%s失效")
    ,批复状态修改失败("2100009","批复状态修改失败")
    ,被纳入批复敞口必须小于纳入批复敞口("2100010","被纳入批复敞口必须小于纳入批复敞口")
    ,存在循环关系("21000011","存在循环关系")
    //取消纳入相关

    ,纳入关系已经取消("2200001","纳入关系已经取消")
    ,纳入关系不存在("2200002","纳入关系不存在")
    //修改
    ,批复不存在("2300001","批复不存在")
    ,该额度已无效不可更改("2300002","该额度已无效不可更改")
    ,批复生效六个月后不可更改("2300003","批复生效六个月后不可更改")
    ,该额度小于已发生额度占用业务金额("2300004","该额度小于已发生额度占用业务金额%s元")
    ,额度生效日修改后应小于额度到期日("2300005","额度生效日修改后应小于额度到期日")
    ,该额度到期日短于已发生额度占用业务最晚到期日("2300006","该额度到期日短于已发生额度占用业务最晚到期日")
    ,冻结的额度节点不能删除("2300007", "冻结的额度节点%s不能删除")
    //替换
    ,被替换批复存在冻结金额("2400001","被替换批复存在冻结金额")
    ,替换关系已经存在("2400002","替换关系已经存在")
    ,不转移列表批复编号为空("2400003","不转移列表批复编号为空")
    ,被替换授信金额不满足("2400004","被替换授信金额不满足")
    ,被替换敞口金额不满足("2400005","被替换敞口金额不满足")
    ,不能自身替换("2400006","不能自身替换")
    ,非替换关系已经存在("2400007","非替换关系已经存在")
    //删除
    ,批复已经发生业务不可删除("2500001","批复已经发生业务不可删除")



//额度状态提前处理
    ,字典类型编号已存在("3000001","字典类型编号已存在")
    ,字典项编号已存在("3000002","字典项编号已存在")
//额度状态提前处理
    ,额度节点状态不是未生效状态("3000003","额度节点状态不是未生效")
    ,上级额度节点不是生效状态("3000004","上级额度节点不是生效状态")
    ,额度节点状态不是生效状态("3000005","额度节点状态不是生效状态")
    ,额度节点不在该批复下("3000006","额度节点不在该批复下")
    ,未生效的授信申请中子额度状态也必须为未生效("3000007","未生效的授信申请中子额度状态也必须为未生效")
    ,额度节点生效时间早于上级节点生效时间("3000008","额度节点生效时间早于上级节点生效时间")
    ,额度节点生效时间晚于下级节点生效时间("3000009","额度节点生效时间晚于下级节点生效时间")
    ,提前或延迟生效日期晚于到期日("3000010","提前或延迟生效日期晚于到期日")
    ,提前或延迟终止日期早于起始日("3000011","提前或延迟终止日期早于起始日")
    ,提前或延迟终止日期早于当前日期("3000012","提前或延迟终止日期早于当前日期")
    ,提前或延迟生效日期早于当前日期("3000013","提前或延迟生效日期早于当前日期")
    ,额度节点不存在("3000014","额度节点不存在")
    ,额度节点状态未生效("3000015","额度节点状态未生效")
    ,批复状态不是未生效("3000016","批复状态不是未生效")
    ,批复状态不是生效状态("3000017","批复状态不是生效状态")
    ,该批复的生效日期字段为空("3000018","该批复的生效日期字段为空")
    ,该批复的到期日期字段为空("3000019","该批复的到期日期字段为空")

//占用相关
    ,额度占用或预占用插入交易流水错误("4000001", "额度占用或预占用插入交易流水错误")
    ,额度占用或预占用额度节点树更新失败("4000002", "额度占用或预占用额度节点树更新失败")
    ,额度占用或预占用更新失败("4000003", "额度占用或预占用更新失败")
    ,请上送担保公司的他用批复信息("4000004","请上送担保公司的他用批复信息")
    ,保存合同累计信息失败("4000005","保存合同累计信息失败")
    ,两次占用的时点不一致("4000006","两次占用的时点不一致")
    ,首笔保证金必须上送关系金额("4000007","首笔保证金必须上送关系金额")
    ,错误的缓释关系类型("4000008","错误的缓释关系类型")
    ,已经存在相同合同占用("4000009","已经存在相同合同占用")
    ,已经存在相同放款占用("4000010","已经存在相同放款占用")
    ,没有适合条件的节点("4000011","没有适合条件的节点")
    ,金额不足("4000012","%s金额不足")
    ,交易日期不在合同有效期("4000013","交易日期不在合同有效期")
    ,已经存在相同编号预占("4000014","已经存在相同编号预占")
    ,请求客户不符合批复客户("4000015","请求客户不符合批复客户")
    ,客户已经到期("4000016","客户已经到期")
    ,合同不存在("4000017","合同不存在")
    ,节点维度不在请求中("4000018", "节点维度不在请求中")
    ,节点维度值不满足("4000019", "节点维度值不满足")
    ,缺乏他用额度占用维度数据("4000020", "缺乏他用额度占用维度数据")
    ,占用余额不足("4000021", "占用余额不足")
    ,合同或票据起始终止日期超出额度期限("4000022", "合同或票据起始终止日期超出额度期限")
    ,该用款为首次领用已经超出首笔提款期不能占用额度("4000023", "该用款为首次领用已经超出首笔提款期不能占用额度")
    ,该用款已经超出提款期不能占用额度("4000024", "该用款已经超出提款期不能占用额度")
    ,批复无可用占用链路("4000025", "批复无可用占用链路")
    ,额度占用检查不通过没有可被占用的额度节点("4000026", "额度占用检查不通过,没有可被占用的额度节点")
    ,批复可用或已用授信金额不足("4000027", "批复可用或已用授信金额不足")
    ,不存在该客户对应额度种类的额度("4000028", "不存在该客户对应额度种类的额度")
    ,客户不存在("4000029","客户不存在")
    ,存在多条占用流水无法修改("4000030", "存在多条占用流水无法修改")
    ,批复节点不可直接放款("4000031", "批复节点不可直接放款")
    ,预占余额不足("4000032", "预占余额不足")
    ,已经存在相同票据占用("4000033","已经存在相同票据占用")
    ,是否外送敞口状态不一致("4000034","是否外送敞口状态不一致")
    ,预占不存在("4000035","预占不存在")
    ,已经存在相同切分占用("4000036","已经存在相同切分占用")
    ,不支持的交易类型("4000037","不支持的交易类型")
    ,占用时上送的敞口金额大于授信金额("4000038","占用时点上送的敞口金额大于授信金额")

//恢复相关
    ,占用流水不存在("5000001", "占用流水不存在")//这个编号票据用了，如果改请通知
    ,该占用已经被撤销("5000002", "该占用已经被撤销")//这个编号票据用了，如果改请通知
    ,更新批复授信金额与敞口金额失败("5000003", "更新批复授信金额与敞口金额失败")
    ,更新额度节点授信金额与敞口金额失败("5000004", "更新额度节点授信金额与敞口金额失败")
    ,更新合同累计信息失败("5000005", "更新合同累计信息失败")
    ,错误的恢复原因("5000006", "错误的恢复原因")
    ,已经有还款记录不能撤销("5000007", "已经有还款记录不能撤销")
    ,合同累积信息不存在("5000008", "合同累积信息不存在")
    ,合同已结清("5000009", "合同已结清")
    ,合同未生效("5000010", "合同未生效")
    ,票据累积信息不存在("5000011", "票据累积信息不存在")
    ,更新票据累计信息失败("5000012", "更新票据累计信息失败")
    ,恢复敞口金额超出占用剩余敞口金额("5000013", "恢复敞口金额超出占用剩余敞口金额")
    ,恢复授信金额超出占用剩余授信金额("5000014", "恢复授信金额超出占用剩余授信金额")
    ,预占部分撤销时上送授信金额和上送敞口金额不能为空("5000015", "预占部分撤销时上送授信金额和上送敞口金额不能为空")
    ,外部上送敞口时此次恢复敞口金额不能为空("5000016", "外部上送敞口时此次恢复敞口金额不能为空")
    ,币种不能为空("5000017", "币种不能为空")
    ,预占已经部分转为实占不能全部撤销("50000018", "预占已经部分转为实占不能全部撤销")
    ,存在多条占用流水记录("5000018", "存在多条占用流水记录")
    ,原合同重新占用失败("5000019", "原合同重新占用失败")
    ,预占已转为实占不能全部撤销("5000020", "预占已转为实占不能全部撤销")
    ,恢复放款占时放款指令编号不能为空("5000021", "恢复放款占时放款指令编号不能为空")//这个编号票据用了，如果改请通知
    ,组合交易下不存在子交易("5000022", "组合交易下不存在子交易")
    ,交易已被冲账("5000023", "交易已被冲账")
    ,预占转实占后无法撤销("5000024", "预占转实占后无法撤销")
    ,票据占用不允许进行撤销("5000025", "票据占用不允许进行撤销")

//白名单相关
    ,白名单不存在("6000001","白名单不存在")
    ,白名单已经存在("6000002","白名单已经存在")
//冻结相关
    ,冻结失败("7000001","冻结失败")
    ,冻结编号不存在("7000002","冻结编号不存在")
    ,冻结已失效("7000003","原冻结已失效")
    ,原冻结类型是全部冻结("7000004","原冻结类型是全部冻结")
    ,额度节点可用授信金额不足("7000005","冻结可用授信金额不足")
    ,额度节点可用敞口金额不足("7000006","冻结可用敞口金额不足")
    ,额度状态不正确("7000007","额度状态不正确")
    ,额度已经是全部冻结状态("7000008","额度已经是全部冻结状态")
    ,额度已经是部分冻结状态("7000009","额度已经是部分冻结状态")
    ,冻结授信金额不正确("7000010","冻结授信金额不正确")
    ,冻结敞口金额不正确("7000011","冻结敞口金额不正确")
    ,失效节点无法冻结("7000012","失效节点无法冻结")
    ,冻结操作类型错误("7000013","冻结操作类型不是全部冻结或者部分冻结")
    ,批复已是全部冻结状态("7000014","批复已是全部冻结状态")
    ,输入金额均为0("7000015","输入的金额均为0")
    ,输入的金额小于0("7000016","输入的金额小于0")
    ,输入的金额均为空("7000017","输入的金额均为空")
    ,更新批复表失败("7000018","更新批复表失败")
    ,更新节点表失败("7000019","更新节点表失败")
    ,新增冻结记录失败("7000020","新增冻结记录失败")
    ,更新冻结表失败("7000021","更新冻结记录失败")
    ,新增节点交易记录失败("7000022","新增节点交易记录失败")
    ,新增解冻记录失败("7000023","新增节点交易记录失败")
//解冻相关
    ,解冻失败("8000001","解冻失败")
    ,解冻授信金额不正确("8000002","解冻授信金额不正确")
    ,解冻敞口金额不正确("8000003","解冻敞口金额不正确")
    ,此冻结记录已经是未冻结状态("8000004","此冻结记录已经是未冻结状态")
    ,解冻类型不正确("8000005","解冻类型不正确")
    ,额度状态为未冻结状态("8000006","额度状态为未冻结状态")


//限额相关
    ,客户编号已存在不能新增("9000001","客户编号已存在不能新增")
    ,限额编号不存在不能修改("9000002","限额编号不存在不能修改")
    ,管控系统不存在该客户信息("9000003","管控系统不存在该客户信息")
    ,客户单一限额失效("9000004","客户单一限额失效")
    ,集团客户单一限额不足("9000005","集团客户单一限额不足")
    ,限额占用检查不通过("9000006","限额占用检查不通过")
    ,客户组合限额失效("9000007","客户组合限额失效"), 该组合限额名义金额不足("9000008", "该组合限额名义金额不足")
    ,限额占用插入交易流水错误("9000009","限额占用插入交易流水错误")
    ,限额占用插入限额交易明细错误("9000010","限额占用插入限额交易明细错误")
    ,限额占用插入合同累计信息表错误("9000011","限额占用插入合同累计信息表错误")
    ,限额占用更新合同累计信息表错误("9000012","限额占用更新合同累计信息表错误")
    ,更新单一限额失败("9000013","更新单一限额失败")
    ,更新组合限额失败("9000014","更新组合限额失败")
    ,该单一限额名义金额使用率已达使用率阀值("9000015", "该单一限额名义金额使用率已达使用率阀值")
    ,客户单一名义金额限额不足("9000016", "客户单一名义金额限额不足")
    ,该组合限额名义金额使用率已达使用率阀值("9000017", "该组合限额名义金额使用率已达使用率阀值")
    ,更新交易流水表失败("9000018", "更新交易流水表失败")
    ,交易金额和敞口金额必输其一("9000019", "交易金额和敞口金额必输其一")
    ,期限维度值不存在("9000020", "期限维度值不存在")
    ,限额不能重复占用("9000021", "限额不能重复占用")
    ,单一限额管控强度不存在("9000022", "单一限额管控强度不存在")
    ,交易流水表数据不存在("9000023", "交易流水表数据不存在")
    , 限额交易明细表数据不存在("9000024", "限额交易明细表数据不存在")
    , 数据转移至单一限额历史表失败("9000025", "数据转移至单一限额历史表失败")
    , 总体金额与敞口金额必填其一("9000026", "总体金额与敞口金额必填其一")
    , 不存在限额恢复数据("9000027", "不存在限额恢复数据")
    , 客户单一敞口金额限额不足("9000028", "客户单一敞口金额限额不足")
    , 该单一限额敞口金额使用率已达使用率阀值("9000029", "该单一限额敞口金额使用率已达使用率阀值")
    , 客户敞口金额组合限额不足("9000030", "客户敞口金额组合限额不足")
    , 该组合限额敞口金额使用率已达使用率阀值("9000031", "该组合限额敞口金额使用率已达使用率阀值")
    , 缓释价值重算之后不能进行撤销恢复("9000032", "缓释价值重算之后不能进行撤销恢复")
    , 更新限额金额失败("9000033", "更新限额金额失败"), 错误的占用时点("9000034", "错误的占用时点")
    , 限额占用实体不存在("9000035", "限额占用实体不存在")
    , 限额占用已被撤销或结清("9000036", "限额占用已被撤销或结清")
    , 非占用额度的业务必须上传占用敞口金额("9000038", "非占用额度的业务必须上传占用敞口金额")
    , 限额占用检查敞口金额("9000039", "该业务没有进行额度占用检查，如果是不占用额度的业务必须上传占用敞口金额")


//组合限额相关
    ,组合限额不存在("1100001","组合限额不存在")
    ,限额约束维度代码为空("1100002","限额约束维度代码为空")
    ,限额约束维度值为空("1100003","限额约束维度值为空")
    ,该笔限额已存在("1100004","该笔限额已存在")
    ,组合限额总体金额不可以比其子限额的金额小("1100005","组合限额总体金额不可以比其子限额的金额小")
    ,组合限额总体金额不可以比其父限额的金额大("1100006","组合限额总体金额不可以比其父限额的金额大")
    ,组合限额管控时点时间不在组合限额时间区间内("1100007","组合限额管控时点时间不在组合限额时间区间内")
    ,组合限额管控时点区间不能为空("1100008","组合限额管控时点区间不能为空")
    ,组合限额新增失败("1100009","组合限额新增失败")
    ,组合限额修改失败("1100010","组合限额修改失败")
    ,失效日期在当前日期之前("1100011","失效日期在当前日期之前")
    ,生效日期在当前日期之前("1100012","生效日期在当前日期之前")
    ,失效日期在生效日期之前("1100013","失效日期在生效日期之前")
    ,组合限额已存在占用记录不可以删除("1100014","组合限额已存在占用记录不可以删除")
    ,组合限额状态已经为删除状态不可重复删除("1100015","组合限额状态已经为删除状态不可重复删除")
    ,汇率不一致("1100016","汇率不一致")
    ,目标金额与目标敞口金额至少输入一项("1100017","目标金额与目标敞口金额至少输入一项")
    ,目标值不能小于0("1100018","目标值不能小于0")
    ,目标敞口值不能小于0("1100019","目标敞口值不能小于0")
    ,管控强度代码不正确("1100020","管控强度代码不正确")
    ,管控时点重复("1100021","管控时点重复")
    ,管控时点代码不正确("1100022","管控时点代码不正确")
    ,组合限额维度代码不正确("1100023","组合限额维度代码不正确")
    ,组合限额维度重复("1100024","组合限额维度重复")
    ,维度值代码不合法("1100025","%s维度下存在不合法的维度值")
    ,维度下不可同时存在父节点和其子节点("1100026","%s维度下不可同时存在父节点及其子节点")
    ,使用率阀值不可以为负值("1100027","使用率阀值不可以为负值")
    ,此生效日区间内已存在相同组合限额("1100028","此生效日区间内已存在相同组合限额，请更改限额的生效日区间")
    ,组合限额敞口金额不可以比其子限额的金额小("1100029","组合限额敞口金额不可以比其子限额的金额小")
    ,组合限额敞口金额不可以比其父限额的金额大("1100030","组合限额敞口金额不可以比其父限额的金额大")
    ,组合限额敞口金额不可以大于目标金额("1100031","组合限额敞口金额不可以大于目标金额")
    ,组合限额目标金额不可以小于已用目标金额("1100032","组合限额目标金额不可以小于已用目标金额")
    ,组合限额敞口金额不可以小于已用敞口金额("1100033","组合限额敞口金额不可以小于已用敞口金额")
    ,组合限额管控开始时间不能晚于管控结束时间("1100034","组合限额管控开始时间不能晚于管控结束时间")
    ,组合限额管控开始时间不能早于限额生效日期("1100035","组合限额管控开始时间不能早于限额生效日期")
    ,组合限额管控结束时间不能晚于限额失效日期("1100036","组合限额管控结束时间不能晚于限额失效日期")
    ,占用时上送敞口金额此次交易敞口金额不能为空("1100037", "占用时上送敞口金额此次交易敞口金额不能为空"), 客户为非关联方客户无法进行关联方批复占用("1100038", "客户为非关联方客户无法进行关联方批复占用")


//单一限额相关
    ,单一限额不存在("1200001","单一限额不存在")
    ,新增单一限额失败("1200002","新增单一限额失败")
    ,修改单一限额失败("1200003","修改单一限额失败")
    ,集团成员的名义金额大于集团的名义金额("1200004","集团成员的名义金额大于集团的名义金额")
    ,集团成员的敞口金额大于集团的敞口金额("1200005","集团成员的敞口金额大于集团的敞口金额")
    ,客户编号关联的单一限额信息不存在("1200006","客户编号关联的单一限额信息不存在")
    ,客户对应的管控强度不存在("1200007","客户对应的管控强度不存在")

//保证金相关

    ,保证金账户不存在("1300001","保证金账户不存在")
    ,保证金数组为空("1300002","保证金数组为空")
    ,保证金可用金额不存在("1300003","保证金%s可用金额不存在")
//押品相关
    ,押品编号不存在("1400001","押品编号不存在")
    ,押品类型为空("1400002","押品类型为空")
//风险敞口相关
    ,合同与保证金关系不正确("1500001","合同与保证金关系不正确")
    ,合同与押品关系不正确("1500002","合同与押品关系不正确")
    ,押品类型不正确("1500003","押品类型不正确")
    ,是否股东关联方不能为空("1500004","是否股东关联方不能为空")
    ,新增垫款合同失败("1500005","新增垫款合同失败")
    ,垫款合同已存在("1500006","垫款合同已存在")
    ,垫款合同与原借据关系已存在("1500007","垫款合同与原借据关系已存在")
    ,合同本次敞口金额计算失败("1500008","合同本次敞口金额计算失败")
    ,原合同不存在("1500009","原合同不存在")
    ,原借据已被其他合同垫款("1500010","原借据已被其他合同垫款")
//新核心查询相关
    ,此合同不存在("1600001","此合同不存在")
    ,核心查询响应超时("1600002","核心查询响应超时")
    ,核心查询结果为空("1600003","核心查询结果为空")
    ,查询押品系统响应结果字段不完整("1600004","查询押品系统响应结果字段不完整")
    ,核心协议号对应的机构号为空("1600005","核心协议号对应的机构号为空")
    ,交换平台网络响应超时("1600006","交换平台网络响应超时，请确认交换平台网络是否正常")

//查询相关
    ,无交易日志记录("1700001","无交易日志记录")
    ,无交易明细记录("1700002","无交易明细记录")
    ,查询结果为空("1700003","查询结果为空")
    ,额度批复查询结果为空("1700004","不存在对应批复记录")
    ,额度节点查询结果为空("1700005","不存在对应额度节点记录")
    ,维度不存在("1700006","不存在对应维度记录")
    ,维度值不存在("1700007","不存在对应维度值记录")
    ,借据不存在("1700008","借据不存在")
    ,管控模式不存在("1700009","管控模式不存在")
    ,客户类型不属于管控客户类型("1700010","客户类型不属于管控客户类型")
    ,缓释物不存在("1700011","缓释物不存在")
    ,合同累计信息为空("1700012","合同累计信息为空")
    ,协议编号对应的合同不存在("1700013","协议编号对应的合同不存在")
    ,合同累计信息重复("1700014","合同累计信息重复")
    ,票据累计信息重复("1700015","票据累计信息重复")
    ,放款日期不在额度提款期内("1700016","放款日期不在额度提款期内")
    ,放款日期不在额度首笔提款期内("1700017","放款日期不在额度首笔提款期内")


//缓释相关
    ,缓释关系已存在("1800001","缓释关系已存在")
    ,缓释关系不存在("1800002","缓释关系不存在")
    ,缓释物类型不存在("1800003","缓释物类型不存在")
    ,保证金可用金额不足("1800004","保证金可用金额不足")
    ,押品价值不足("1800005","押品价值不足")
    ,添加关系失败("1800006","添加关系失败")
    ,缓释关系不能解除("1800007","缓释关系不能解除")
    ,押品保证金关系不存在("1800008","押品保证金关系不存在")
    ,押品保证金关系已存在("1800009","押品保证金关系已存在")
    ,版本不一致("1800010", "版本不一致")
    ,原保证金账户不存在("1800011", "原保证金账户不存在")
    ,更新金额操作失败("1800012", "更新金额操作失败")
    ,更新缓释关系失败("1800013", "更新缓释关系失败")
    ,重新分配缓释物失败("1800014", "重新分配缓释物失败")
    ,解除关系失败("1800015", "解除关系失败")
    ,替换关系失败("1800016", "替换关系失败")
    ,试算后价值不足("1800017", "试算后价值不足")
    ,缓释物关系类型不存在("1800018", "缓释物关系类型不存在")
    ,新增缓释关系失败("1800019", "新增缓释关系失败"), 插入限额交易明细失败("1800020", "插入限额交易明细失败")
    , 插入限额交易流水表失败("1800021", "插入限额交易流水表失败")
    , 缓释价值变动更新限额失败("1800022", "缓释价值变动更新限额失败")
    , 该保证金没有关联有效的合同("1800023", "该保证金没有关联有效的合同")
    , 该押品没有关联有效的合同("1800024", "该押品没有关联有效的合同")
    , 明确分配金额的缓释物可分配金额不足("1800025", "明确分配金额的缓释物可分配金额不足")
    , 合同所在节点敞口金额不满足("1800026", "合同所在节点敞口金额不满足")
    , 首保必须明确分配金额("1800027", "首保必须明确分配金额")
    , 强制解除操作失败("1800028", "强制解除操作失败")

//保证金子账户查询
    ,保证金联机批量查询失败("1900001", "保证金联机批量查询失败,详情：%s")
    ,文件上传失败("1900002", "文件上传失败（%s）")
    ,文件下载失败("1900003", "文件下载失败（%s）")
    ,文件读取失败("1900004", "文件读取失败（%s）")
    ,文件解析失败("1900005", "文件解析失败（%s）")
    ,交易笔数不正确("1900006", "交易笔数不正确（%s）")
    //票据占用
    , 票据无可用同业客户批复("2600001", "票据无可用同业客户批复（%s）")
    , 票据检查成功("2600003", "票据检查成功（%s）")
    , 票据不存在("2600004", "票据不存在（%s）")
    , 票据占用失败("2600006", "票据占用失败（%s）")
    , 未检测("2600007", "未检测（%s）")
    , 票据号重复("2600008", "票据号重复（%s）")
    , 存在检查失败票据("2600009", "存在检查失败票据（%s）")

    //额度占用修改相关错误码
    , 没有进行任何修改("2200000", "没有进行任何修改")
    , 预占转实占后无法修改("2200001", "预占转实占后无法修改")

    //限额白名单
    , 新增限额白名单失败("2700001", "新增限额白名单失败")
    //
    , 更新限额白名单失败("2700002", "更新限额白名单失败")
    //借新还旧
    , 借据余额为0("2800001", "借据余额为0")
    //额度报文
    ,结果报文为空("2900001","结果报文为空")
    ,结果报文解析失败("2900002","结果报文解析失败")
    //批复重算
    , 批复不存在或批复下无节点("3100001", "批复不存在或批复下无节点"), 不可循环批复不能重算("3100002", "不可循环批复不能重算")
    ;

    public static ErrorCode getByCode(String code) {
        return map.get(code);
    }

    private static Map<String, ErrorCode> map;

    static {
        map = new HashMap<String, ErrorCode>();
        for (ErrorCode e : ErrorCode.values()) {
            map.put(e.getCode(), e);
        }
    }


    public boolean equals(String code) {
        return this.code.equals(code);
    }

    public String getCode() {
        return code;
    }

    public String getName() {
        return name;
    }

    private final String code;
    private final String name;

    private ErrorCode(String code, String name) {
        this.code = code;
        this.name = name;
    }

}
